App/househelp-api/scripts/perf/results-20260503-174136/services_list.txt
Running 30s test @ http://localhost:8080/api/v1/services
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.23ms   16.26ms 333.49ms   95.12%
    Req/Sec     6.40k     2.00k   13.17k    70.27%
  Latency Distribution
     50%    4.74ms
     75%    9.70ms
     90%   16.97ms
     99%   65.42ms
  2282429 requests in 30.10s, 1.92GB read
  Non-2xx or 3xx responses: 2282414
Requests/sec:  75830.12
Transfer/sec:     65.23MB